{
  "name": "Mounika Uppalapati",
  "title": "Java Developer",
  "tagline": "Building scalable backend systems and enterprise applications using Java, Spring Boot, and cloud-native technologies",
  "phone": "(314)-789-6996",
  "email": "uppalapati2001@gmail.com",
  "linkedin": "https://www.linkedin.com/in/uppalapati-mounika",
  "github": "https://github.com/mounika1507",

  "summary": "Java Developer with 3+ years of experience building secure, scalable, and high-performance backend and full-stack applications. Skilled in Java, Spring Boot, Microservices, REST APIs, SQL/NoSQL databases, and AWS cloud deployment. Experienced in designing modular architectures, optimizing backend performance, integrating distributed systems, and collaborating in Agile teams to deliver production-ready enterprise software.",

  "experience": [
    {
      "company": "Sradha Technologies",
      "role": "Java Developer",
      "period": "March 2025 – Present",
      "location": "McKinney, TX",
      "description": "Developing scalable backend systems using Java, Spring Boot, Microservices, and REST APIs. Implementing secure authentication, integrating SQL/NoSQL databases, optimizing application performance, and contributing to cloud deployments on AWS. Building distributed data-processing solutions and collaborating in Agile teams to deliver enterprise-grade software."
    },
    {
      "company": "Globestar Software Limited",
      "role": "Java Developer",
      "period": "Aug 2021 – Dec 2022",
      "location": "Remote",
      "description": "Developed and maintained backend services using Java and Spring Boot. Implemented REST APIs, enhanced database performance (SQL Server, DB2), and contributed to full-stack development with React and Angular. Integrated Kafka for inter-service communication and improved API security with Spring Security and JWT."
    },
    {
      "company": "Supraja Technologies",
      "role": "Web Development Intern",
      "period": "Mar 2021 – Jul 2021",
      "location": "India",
      "description": "Built responsive web interfaces using HTML, CSS, JavaScript, and Bootstrap. Gained hands-on experience in API integration, Git workflows, and Agile development practices while supporting full-stack application development."
    }
  ],

  "education": [
    {
      "institution": "Missouri University of Science and Technology",
      "degree": "Master of Science (MS) in Computer and Information Sciences",
      "location": "Rolla, MO, USA"
    },
    {
      "institution": "Prasad V. Potluri Siddhartha Institute of Technology",
      "degree": "Bachelor's Degree in Information Technology",
      "location": "Vijayawada, India"
    }
  ],

  "skills": {
    "programming": ["Java", "Python", "JavaScript", "TypeScript"],
    "backend": ["Spring Boot", "Microservices", "REST APIs", "Node.js", "Express"],
    "frontend": ["React.js", "Angular", "HTML", "CSS"],
    "databases": ["SQL Server", "PostgreSQL", "MongoDB", "DB2"],
    "cloudDevOps": ["AWS", "CI/CD", "Docker", "Git", "GitHub Actions"]
  },

  "certifications": [
    "Oracle Cloud Infrastructure 2025 AI Foundations Associate",
    "AWS Certified Solutions Architect"
  ],

  "projects": [
    {
      "title": "Self-Supervised Classification Network",
      "description": "Implemented SimCLR for self-supervised learning to improve representation quality for downstream classification tasks.",
      "tech": ["Python", "PyTorch", "CUDA"],
      "link": "#"
    },
    {
      "title": "Driver Drowsiness Detection",
      "description": "Developed a real-time drowsiness detection system using computer vision and deep learning to enhance road safety.",
      "tech": ["Python", "OpenCV", "TensorFlow"],
      "link": "#"
    },
    {
      "title": "Forest Fire Prediction",
      "description": "Built a predictive ML model for forecasting forest fires using environmental data, including data analysis and visualization.",
      "tech": ["Python", "scikit-learn", "Pandas"],
      "link": "#"
    },
    {
      "title": "Green Basket E-Commerce Website",
      "description": "Developed a responsive e-commerce app with dynamic product listings, shopping cart functionality, and optimized UI/UX.",
      "tech": ["React", "TypeScript", "HTML", "CSS"],
      "link": "#"
    },
    {
      "title": "Self-Budgeting App",
      "description": "Created a cross-platform budgeting app with expense tracking, category management, and monthly summaries.",
      "tech": ["React Native", "Expo", "AsyncStorage"],
      "link": "#"
    }
  ]
}
